<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"7c1a071edf7318c926d6cab5108fb9c8844af4575f09299ca8eb4c4141541c6e","plan_job_ref":"Job Pull Request Checks #3916 at https://github.com/GSA-TTS/FAC/actions/runs/11747115837","plan_out_hash":"0cd33e55fcdf0743b0779b95b5f3731ba3d8e12c1c8d3db9cb0655af752600c4","plan_hash":"d4aa74b924d86c78029f10f129512dffa8eb39f410e839852f120bc63799e9e4","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.environments["dev"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../dev/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["dev"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.51.3"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../dev/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["preview"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../preview/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["preview"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.51.3"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../preview/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["production"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../production/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["production"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.51.3"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../production/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["staging"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../staging/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["staging"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.51.3"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../staging/providers-managed.tf"
+       id                   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.s3-backups.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/s3-backups/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases
```
</details>

:memo: Plan generated in [Pull Request Checks #3916](https://github.com/GSA-TTS/FAC/actions/runs/11747115837)